C016:Leet文字列
C016:Leet文字列
30分24秒経過
1時間経過で時間切れ
Leet と呼ばれるインターネットスラングがあります。
Leet ではいくつかのアルファベットをよく似た形の他の文字に置き換えて表記します。 Leet の置き換え規則はたくさんありますが、ここでは次の置き換え規則のみを考えましょう。

置き換え前	置き換え後
A	4
E	3
G	6
I	1
O	0
S	5
Z	2
文字列が入力されるので、これを Leet に変換して出力するプログラムを書いてください。
評価ポイント
10回のテストケースで、正答率、実行速度、メモリ消費量をはかり得点が決まります。
より早い回答時間で提出したほうが得点が高くなります。
複数のテストケースで正しい出力がされるか評価（+50点）
解答までの速さ評価（+50点）
入力される値
入力は以下のフォーマットで与えられます。

s
s は Leet に変換する前の文字列を表します。

それぞれの値は文字列で標準入力から渡されます。標準入力からの値取得方法はこちらをご確認ください
期待する出力
s を Leet に変換した文字列を１行に出力してください。

最後は改行し、余計な文字、空行を含んではいけません。
条件
すべてのテストケースで以下の条件を満たします。

・1 ≦ (s の長さ) ≦ 100
・s はアルファベット大文字のみからなる

入力例1
PAIZA
出力例1
P4124
入力例2
ALANTURING
出力例2
4L4NTUR1N6